package ru.amogus.bot.messageComposers;

public enum ResponseConstants {
    HELLO("Привет!\n" +
            "Чтобы ознакомиться с функционалом бота, отправь /help!"),
    HELP("Для получения информации о цене на интересующую тебя книгу, отправь мне фотографию, где будет *чётко* виден штрихкод с ISBN-кодом, или просто сам ISBN-код в виде текстового сообщения.\n" +
            "\n_Список доступных команд:_\n" + "/randompoem - случайный экземпляр из коллекции русской поэзии!\n" +
            "/example - пример фотографии со штрихкодом ISBN."),
    EXAMPLE("Пример фото со штрихкодом ISBN\n\n" + "Также ты просто можешь отправить ISBN в виде текстового сообщения, например: " +
            "978-5-17-098748-1 или 9785170987481"),
    UNREADABLE_BARCODE("К сожалению, не удалось распознать штрихкод. Попробуй отправить ещё одно фото!"),
    INVALID_ISBN("Данный ISBN является инвалидным!"),
    WRONG_PHOTO_FORMAT("К сожалению, я не могу обработать файл такого расширения." +
            "\nОтправь мне компрессированное (сжатое) фото или файл с расширением _.bmp_, _.gif_, _.jpg_ или _.png_!"),
    UNKNOWN_ISBN("К сожалению, по присланному ISBN не удалось найти никакой книги.\nЕсли на изображении со штрихкодом код ISBN отличен от самого штрихкода, то " +
            "попробуй отправить мне именно этот код!\nЕсли по обоим кодам не удаётся найти книгу, то скорее всего этого издания нет на KnigaBook.com.");

    private final String content;

    ResponseConstants(String content){
        this.content = content;
    }

    public String getContent(){
        return content;
    }
}
